{"keras_version": "1.2.0", "config": [{"config": {"trainable": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "subsample": [2, 2], "W_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "nb_col": 5, "border_mode": "valid", "nb_filter": 24, "activity_regularizer": null, "name": "convolution2d_1", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "subsample": [2, 2], "W_regularizer": null, "activation": "linear", "nb_col": 5, "border_mode": "valid", "nb_filter": 36, "activity_regularizer": null, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "subsample": [2, 2], "W_regularizer": null, "activation": "linear", "nb_col": 5, "border_mode": "valid", "nb_filter": 48, "activity_regularizer": null, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "W_regularizer": null, "activation": "linear", "nb_col": 3, "border_mode": "valid", "nb_filter": 64, "activity_regularizer": null, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "W_regularizer": null, "activation": "linear", "nb_col": 3, "border_mode": "valid", "nb_filter": 64, "activity_regularizer": null, "name": "convolution2d_5"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "input_dim": 1152, "output_dim": 1164, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"trainable": true, "input_dim": 1164, "output_dim": 100, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"trainable": true, "input_dim": 100, "output_dim": 50, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"trainable": true, "input_dim": 50, "output_dim": 10, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation"}, {"config": {"trainable": true, "input_dim": 10, "output_dim": 1, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "name": "dense_5"}, "class_name": "Dense"}], "class_name": "Sequential"}