{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 36, "name": "convolution2d_1", "activation": "linear", "W_constraint": null, "bias": true, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "nb_col": 5, "nb_row": 5, "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "name": "convolution2d_2", "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "bias": true, "trainable": true, "b_constraint": null, "activation": "linear", "subsample": [2, 2], "nb_col": 5, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "name": "convolution2d_3", "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "bias": true, "trainable": true, "b_constraint": null, "activation": "linear", "subsample": [2, 2], "nb_col": 5, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_filter": 96, "name": "convolution2d_4", "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "bias": true, "trainable": true, "b_constraint": null, "activation": "linear", "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_filter": 96, "name": "convolution2d_5", "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "bias": true, "trainable": true, "b_constraint": null, "activation": "linear", "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "output_dim": 1164, "input_dim": 1728, "trainable": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "output_dim": 100, "input_dim": 1164, "trainable": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_3", "init": "glorot_uniform", "W_constraint": null, "output_dim": 50, "input_dim": 100, "trainable": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_4", "init": "glorot_uniform", "W_constraint": null, "output_dim": 10, "input_dim": 50, "trainable": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_5", "init": "glorot_uniform", "W_constraint": null, "output_dim": 1, "input_dim": 10, "trainable": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null}}]}