{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_row": 5, "input_dtype": "float32", "activation": "linear", "nb_filter": 36, "batch_input_shape": [null, 66, 200, 3], "bias": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_1", "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "trainable": true, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_row": 5, "activation": "linear", "nb_filter": 48, "bias": true, "subsample": [2, 2], "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_2", "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_row": 5, "activation": "linear", "nb_filter": 64, "bias": true, "subsample": [2, 2], "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_3", "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_row": 3, "activation": "linear", "nb_filter": 96, "bias": true, "subsample": [1, 1], "W_constraint": null, "init": "glorot_uniform", "nb_col": 3, "name": "convolution2d_4", "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_row": 3, "activation": "linear", "nb_filter": 96, "bias": true, "subsample": [1, 1], "W_constraint": null, "init": "glorot_uniform", "nb_col": 3, "name": "convolution2d_5", "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1164, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "input_dim": 1728, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "output_dim": 100, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "input_dim": 1164, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "output_dim": 50, "name": "dense_3", "activity_regularizer": null, "W_regularizer": null, "input_dim": 100, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "output_dim": 10, "name": "dense_4", "activity_regularizer": null, "W_regularizer": null, "input_dim": 50, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1, "name": "dense_5", "activity_regularizer": null, "W_regularizer": null, "input_dim": 10, "b_regularizer": null, "b_constraint": null}}], "keras_version": "1.2.0"}