{"keras_version": "1.2.0", "config": [{"config": {"nb_row": 5, "bias": true, "border_mode": "valid", "activation": "linear", "name": "convolution2d_1", "input_dtype": "float32", "subsample": [2, 2], "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 36, "nb_col": 5, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "W_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_row": 5, "bias": true, "border_mode": "valid", "activation": "linear", "name": "convolution2d_2", "subsample": [2, 2], "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 48, "nb_col": 5, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_row": 5, "bias": true, "border_mode": "valid", "activation": "linear", "name": "convolution2d_3", "subsample": [2, 2], "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "nb_col": 5, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "bias": true, "border_mode": "valid", "activation": "linear", "name": "convolution2d_4", "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 96, "nb_col": 3, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "bias": true, "border_mode": "valid", "activation": "linear", "name": "convolution2d_5", "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 96, "nb_col": 3, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "b_constraint": null, "input_dim": 1728, "output_dim": 1164, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"bias": true, "b_constraint": null, "input_dim": 1164, "output_dim": 100, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_6", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"bias": true, "b_constraint": null, "input_dim": 100, "output_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "b_constraint": null, "input_dim": 50, "output_dim": 10, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "b_constraint": null, "input_dim": 10, "output_dim": 1, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_5", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}