{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_filter": 36, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "batch_input_shape": [null, 66, 200, 3], "W_regularizer": null, "W_constraint": null, "activation": "linear", "subsample": [2, 2], "init": "glorot_uniform", "nb_col": 5, "nb_row": 5, "input_dtype": "float32", "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_filter": 48, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "nb_row": 5, "subsample": [2, 2], "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "nb_col": 5, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_filter": 64, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "nb_row": 5, "subsample": [2, 2], "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "nb_col": 5, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_filter": 96, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "nb_col": 3, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_filter": 96, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "nb_col": 3, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_5"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 1728, "output_dim": 1164, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.6, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 1164, "output_dim": 100, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.6, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 100, "output_dim": 50, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 50, "output_dim": 10, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "dense_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 10, "output_dim": 1, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "dense_5"}}]}