{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "subsample": [2, 2], "batch_input_shape": [null, 66, 200, 3], "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "input_dtype": "float32", "bias": true, "nb_col": 5, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "nb_row": 5, "trainable": true, "nb_filter": 36, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "subsample": [2, 2], "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "nb_col": 5, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 5, "trainable": true, "nb_filter": 48, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "subsample": [2, 2], "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "nb_col": 5, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 5, "trainable": true, "nb_filter": 64, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "trainable": true, "nb_filter": 96, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "nb_col": 3, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "trainable": true, "nb_filter": 96, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1164, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "input_dim": 1728, "name": "dense_1", "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "input_dim": 1164, "name": "dense_2", "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "input_dim": 100, "name": "dense_3", "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "input_dim": 50, "name": "dense_4", "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "input_dim": 10, "name": "dense_5", "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear"}}], "keras_version": "1.2.0"}