{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "nb_col": 5, "nb_row": 5, "b_regularizer": null, "activation": "linear", "name": "convolution2d_1", "trainable": true, "border_mode": "valid", "input_dtype": "float32", "b_constraint": null, "subsample": [2, 2], "W_constraint": null, "init": "glorot_uniform", "nb_filter": 36, "W_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "activation": "linear", "name": "convolution2d_2", "trainable": true, "border_mode": "valid", "b_constraint": null, "subsample": [2, 2], "W_constraint": null, "init": "glorot_uniform", "nb_filter": 48, "W_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "activation": "linear", "name": "convolution2d_3", "trainable": true, "border_mode": "valid", "b_constraint": null, "subsample": [2, 2], "W_constraint": null, "init": "glorot_uniform", "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "activation": "linear", "name": "convolution2d_4", "trainable": true, "border_mode": "valid", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "init": "glorot_uniform", "nb_filter": 96, "W_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "activation": "linear", "name": "convolution2d_5", "trainable": true, "border_mode": "valid", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "init": "glorot_uniform", "nb_filter": 96, "W_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "output_dim": 1164, "b_regularizer": null, "activation": "linear", "name": "dense_1", "trainable": true, "b_constraint": null, "input_dim": 1728, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "activation": "linear", "name": "dense_2", "trainable": true, "b_constraint": null, "input_dim": 1164, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_6", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "activation": "linear", "name": "dense_3", "trainable": true, "b_constraint": null, "input_dim": 100, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "output_dim": 10, "b_regularizer": null, "activation": "linear", "name": "dense_4", "trainable": true, "b_constraint": null, "input_dim": 50, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "activation": "linear", "name": "dense_5", "trainable": true, "b_constraint": null, "input_dim": 10, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}]}