{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "nb_filter": 24, "bias": true, "b_constraint": null, "b_regularizer": null, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "trainable": true, "activation": "linear", "W_constraint": null, "border_mode": "valid", "subsample": [2, 2], "name": "convolution2d_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "bias": true, "b_constraint": null, "b_regularizer": null, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 36, "trainable": true, "activation": "linear", "W_constraint": null, "border_mode": "valid", "subsample": [2, 2], "name": "convolution2d_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "bias": true, "b_constraint": null, "b_regularizer": null, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 48, "trainable": true, "activation": "linear", "W_constraint": null, "border_mode": "valid", "subsample": [2, 2], "name": "convolution2d_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "bias": true, "b_constraint": null, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 64, "trainable": true, "activation": "linear", "W_constraint": null, "border_mode": "valid", "subsample": [1, 1], "name": "convolution2d_4"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "bias": true, "b_constraint": null, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 64, "trainable": true, "activation": "linear", "W_constraint": null, "border_mode": "valid", "subsample": [1, 1], "name": "convolution2d_5"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1164, "input_dim": 1152, "W_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 100, "input_dim": 1164, "W_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "name": "dense_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 50, "input_dim": 100, "W_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "name": "dense_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 10, "input_dim": 50, "W_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "name": "dense_4"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1, "input_dim": 10, "W_regularizer": null, "activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "name": "dense_5"}}]}