{"config": [{"config": {"trainable": true, "nb_filter": 36, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "nb_row": 5, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "batch_input_shape": [null, 66, 200, 3], "subsample": [2, 2], "nb_col": 5, "b_constraint": null, "activation": "linear", "input_dtype": "float32", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "nb_filter": 48, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "nb_row": 5, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_2", "W_constraint": null, "subsample": [2, 2], "nb_col": 5, "b_constraint": null, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "nb_row": 5, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_3", "W_constraint": null, "subsample": [2, 2], "nb_col": 5, "b_constraint": null, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "nb_filter": 96, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_4", "W_constraint": null, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "nb_filter": 96, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_5", "W_constraint": null, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 1164, "input_dim": 1728, "W_regularizer": null, "name": "dense_1", "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 100, "input_dim": 1164, "W_regularizer": null, "name": "dense_2", "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_6", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 50, "input_dim": 100, "W_regularizer": null, "name": "dense_3", "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 10, "input_dim": 50, "W_regularizer": null, "name": "dense_4", "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 1, "input_dim": 10, "W_regularizer": null, "name": "dense_5", "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}