{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_filter": 36, "trainable": true, "W_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "bias": true, "batch_input_shape": [null, 66, 200, 3], "name": "convolution2d_1", "activity_regularizer": null, "border_mode": "valid", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_filter": 48, "trainable": true, "W_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "bias": true, "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_filter": 64, "trainable": true, "W_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "bias": true, "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_filter": 96, "trainable": true, "W_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3, "bias": true, "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_4"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_filter": 96, "trainable": true, "W_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3, "bias": true, "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_5"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "b_constraint": null, "bias": true, "trainable": true, "output_dim": 1164, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": 1728, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "b_constraint": null, "bias": true, "trainable": true, "output_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": 1164, "name": "dense_2", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "b_constraint": null, "bias": true, "trainable": true, "output_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": 100, "name": "dense_3", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "b_constraint": null, "bias": true, "trainable": true, "output_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": 50, "name": "dense_4", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "b_constraint": null, "bias": true, "trainable": true, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": 10, "name": "dense_5", "activity_regularizer": null}}], "keras_version": "1.2.0"}