{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "b_constraint": null, "batch_input_shape": [null, 66, 200, 3], "init": "glorot_uniform", "input_dtype": "float32", "dim_ordering": "tf", "activation": "linear", "bias": true, "nb_filter": 36, "W_constraint": null, "nb_row": 5, "nb_col": 5, "name": "convolution2d_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_2", "subsample": [2, 2], "b_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activation": "linear", "bias": true, "nb_filter": 48, "W_constraint": null, "nb_row": 5, "nb_col": 5, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_3", "subsample": [2, 2], "b_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activation": "linear", "bias": true, "nb_filter": 64, "W_constraint": null, "nb_row": 5, "nb_col": 5, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_4", "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activation": "linear", "bias": true, "nb_filter": 96, "W_constraint": null, "nb_row": 3, "nb_col": 3, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_5", "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activation": "linear", "bias": true, "nb_filter": 96, "W_constraint": null, "nb_row": 3, "nb_col": 3, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1164, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "activation": "linear", "bias": true, "input_dim": 1728, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 100, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_2", "activation": "linear", "bias": true, "input_dim": 1164, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 50, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_3", "activation": "linear", "bias": true, "input_dim": 100, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 10, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_4", "activation": "linear", "bias": true, "input_dim": 50, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_5", "activation": "linear", "bias": true, "input_dim": 10, "W_constraint": null}}]}